In [3]:
import numpy as np
import pandas as pd

In [5]:
sozluk1={"İsim":["Ahmet","Mehmet","Zeynep","Atıl"],
        "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
        "Kalori":[100,200,300,400]}

In [11]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [13]:
dataFrame1

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [15]:
sozluk2={"İsim":["Osman","Levent","Atlas","Fatma"],
        "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
        "Kalori":[500,600,700,800]}

In [19]:
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [25]:
sozluk3={"İsim":["Aslan","Alin","Lina","Vera"],
        "Spor":["Koşu","Yüzme","Badminton","Tenis"],
        "Kalori":[150,250,350,450]}

In [27]:
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

## concatenation

In [34]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      İsim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     500
5   Levent      Yüzme     600
6    Atlas       Koşu     700
7    Fatma  Basketbol     800
8    Aslan       Koşu     150
9     Alin      Yüzme     250
10    Lina  Badminton     350
11    Vera      Tenis     450

## merge

In [39]:
mergeSozluk1={"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
             "Spor":["Koşu","Yüzme","Koşu","Basketbol"]}

In [41]:
mergeDataFrame1=pd.DataFrame(mergeSozluk1)

In [43]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [55]:
mergeSozluk2={"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
             "Kalori":[100,200,300,400]}

In [57]:
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [59]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     300
3    Atıl     400

In [61]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [63]:
maasSozluk={"Isim":["Atıl","Zeynep","Mehmet","Ahmet"],
           "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
           "Maas":[200,300,400,500]}

In [65]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [67]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [69]:
maasDataFrame["Departman"]

0      Yazılım
1        Satış
2    Pazarlama
3      Yazılım
Name: Departman, dtype: object

In [71]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [73]:
maasDataFrame["Departman"].nunique()

3

In [75]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [83]:
def bruttenNete(maas):
    return maas*0.66

In [85]:
maasDataFrame["Maas"]

0    200
1    300
2    400
3    500
Name: Maas, dtype: int64

In [87]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [89]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [99]:
yeniSozluk={"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson","Simpson"],
           "Karakter Ismi":["Cartman","Kenny","Homer","Bart","Bart"],
           "Karakter Yas":[9,10,50,20,10]}

In [101]:
karakterDF=pd.DataFrame(yeniSozluk)

In [103]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [111]:
karakterDF.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                   15.0
                Homer                  50.0
South Park      Cartman                 9.0
                Kenny                  10.0